In [1]:
#used when 
#1. Data still not clean after melting and pivoting 
#2. Complex operation on rows

import pandas as pd

In [2]:
df = pd.DataFrame({'a': [10,20,30], 'b': [20,30,40]})
df

    a   b
0  10  20
1  20  30
2  30  40

In [5]:
df[['a','b']] ** 2

     a     b
0  100   400
1  400   900
2  900  1600

In [8]:
def square(x):
    return x**2

def avg_2(x,y,c):
    c= (x + y)/2
    return c

def display(x):
    print(x)

def avg_3(x,y,z):
    return(x + y + z)/3

def new_avg(col):
    x = col[0]
    y = col[1]
    z = col[2]
    
    return(x+y+z)/3

def row_avg(row):
    x = row[0]
    y = row[1]
    
    return(x+y)/2

In [11]:
#If we want to use apply, use it as a method 
df[['a','b','c']].apply(avg_2)

KeyError: "['c'] not in index"

In [7]:
#we can specify how we want to apply - row or column 

#if we want apply on data frame
df.apply(display)
#apply on a df works on column by default 
#df.apply(avg_3)
#wont work since avg3 is missing 2 values and entire column is passed into 1st parameter
#so change the function
df.apply(new_avg)

0    10
1    20
2    30
Name: a, dtype: int64
0    20
1    30
2    40
Name: b, dtype: int64

a    20.0
b    30.0
dtype: float64

In [8]:
#if we want to work with apply row wise
df.apply(row_avg, axis = 1)

0    15.0
1    25.0
2    35.0
dtype: float64

In [12]:
titanic = pd.read_csv('../SeabornDataset/titanic.csv')

In [13]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [10]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
survived       891 non-null int64
pclass         891 non-null int64
sex            891 non-null object
age            714 non-null float64
sibsp          891 non-null int64
parch          891 non-null int64
fare           891 non-null float64
embarked       889 non-null object
class          891 non-null object
who            891 non-null object
adult_male     891 non-null bool
deck           203 non-null object
embark_town    889 non-null object
alive          891 non-null object
alone          891 non-null bool
dtypes: bool(2), float64(2), int64(4), object(7)
memory usage: 92.3+ KB

In [14]:
import numpy as np

In [15]:
#count no of missing values 
#count proportion of missing values 
#count proportion of complete values 
def count_missing(vec):
    null_vec = pd.isnull(vec)
    null_count = np.sum(null_vec)
    return (null_count)

def prop_missing(vec):
    num = count_missing(vec)
    den = vec.size
    return (num/den)

def prop_complete(vec):
    return 1 - prop_missing(vec)

In [19]:
titanic.apply(count_missing)

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [14]:
#make sure missing values dont have a pattern 
titanic.loc[pd.isnull(titanic['embark_town']),:]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
61,1,1,female,38.0,0,0,80.0,NaN,First,woman,False,B,NaN,yes,True
829,1,1,female,62.0,0,0,80.0,NaN,First,woman,False,B,NaN,yes,True

In [16]:
titanic.apply(count_missing, axis=1).value_counts()
#for each row how many missing there are 

#value counts - 1 - 589 rows have 1 missing value
#182 rows have 0 missing values
#160 rows have 2 missing values

1    549
0    182
2    160
dtype: int64

In [17]:
def clean_1_col(single_col):
    return(single_col[1:])

In [18]:
clean_1_col('d42')

'42'